Конфигурация отчетов/Enums/ВидыВалидацииОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыВалидацииОтветов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Найдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНайдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСоответствиеТипов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/CommonModules/Номенклатура_Модуль/Ext/Module.bsl
#Область СтруктурыПараметров
Функция ОбязательныеПараметрыНоменклатуры() Экспорт 

	Параметры = Новый Структура;
	Параметры.Вставить("Наименование", Тип("Строка"));
	Параметры.Вставить("Код", Тип("Число"));
	//Параметры.Вставить("ЕдиницыИзмирения", Тип("Перечисление.ЕдиницыИзмирения"));
	
	Возврат Параметры;
	
КонецФункции


Функция СтруктураТиповКлючейФайловЗагрузки(ВидДокумента) Экспорт 
	
	ТипыКлючей = Новый Структура;
	
	Если ВидДокумента = "Переоценка" Тогда
		ТипыКлючей.Вставить("ID", Тип("Число")); 
		ТипыКлючей.Вставить("PRISE", Тип("Число")); 
        ТипыКлючей.Вставить("GROUP_ID", Тип("Число")); 
        ТипыКлючей.Вставить("GROUP_NAME", Тип("Строка")); 
        ТипыКлючей.Вставить("NAME", Тип("Срока"));
		//поля которые пока что не использую GROUP_ORD ZONE_ID ZONE_NAME UKT_ZED BARCODE STAMP TAX TAXX_GROUP CR
	КонецЕсли;
	
   Возврат ТипыКлючей;
	
КонецФункции  

Функция СтруктураСоответствиеКлючей()

	СтруктураСоответствий = Новый Структура;
	СтруктураСоответствий.Вставить("Наименование", "NAME");            
	СтруктураСоответствий.Вставить("Код", "ID");
	//СтруктураСоответствий.Вставить("", "");
	        
	Возврат СтруктураСоответствий;

КонецФункции // СтруктураСоответствиеКлючей()


#КонецОбласти       


#Область УправлениеСправочником
//создание елементов справоничка
Функция СозданиеНовойНоменклатуры(ПараметрыНоменклатуры) Экспорт //ПараметрыНоменклатуры - структура из обезательных параметров  	
	
	//Если ПроверитьОбязательныеПараметры(ПараметрыНоменклатуры) = Ложь Тогда 
	//	Возврат Ложь;
	//КонецЕсли;
	СоответствиеКлючей = СтруктураСоответствиеКлючей(); 

	Код = ПараметрыНоменклатуры[СоответствиеКлючей["Код"]]; 
	Наименование = СокрЛП(ПараметрыНоменклатуры[СоответствиеКлючей["Наименование"]]); 
	
	РезультатПроверки = ПроверкаНаличиеНоменклатуры(Код); 
	
	Если РезультатПроверки.Результат Тогда // номенклатура была найдена
		Возврат Ложь;
	КонецЕсли;
	
	Если РезультатПроверки.Результат = Перечисления.ВидыВалидацииОтветов.НеСоответствиеТипов Тогда
		Возврат Ложь;	
	КонецЕсли;
	
		
	Ном = Справочники.Номенклатура.СоздатьЭлемент();  
	Ном.Код = Код;
	Ном.Наименование = Наименование; 
	//Ном.ЕдиницаИзмирения = СокрЛП(ПараметрыНоменклатуры.ЕдиницыИзмирения); 
	
	Попытка
		Ном.Записать(); 
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти       


#Область Запросы
	//проверка наличие елемента
Функция ПроверкаНаличиеНоменклатуры(КодНоменклатуры) Экспорт
    Ответ = Новый Структура;
	
	Если ТипЗнч(КодНоменклатуры) <> Тип("Число") Тогда
		Ответ.Вставить("Результат", Ложь);
		Ответ.Вставить("Вид", Перечисления.ВидыВалидацииОтветов.НеСоответствиеТипов);
		Ответ.Вставить("ОписаниеРезультата", "Код не является типов числа!");
		Возврат Ответ;
	КонецЕсли;
	
	Ном = Справочники.Номенклатура.НайтиПоКоду(Формат(КодНоменклатуры, "ЧГ=3,0"));
	Если Ном.Пустая() Тогда
		Ответ.Вставить("Результат", Ложь);       
		Ответ.Вставить("Вид", Перечисления.ВидыВалидацииОтветов.НеНайдено);
		Ответ.Вставить("ОписаниеРезультата", "Номенклатура не найдена!");
		Возврат Ответ; 
	
	КонецЕсли;
	
	
	Ответ.Вставить("Результат", Истина);
	Ответ.Вставить("Вид", Перечисления.ВидыВалидацииОтветов.Найдено);
	Ответ.Вставить("ОписаниеРезультата", Ном);
	Возврат Ответ;

КонецФункции 	

#КонецОбласти       


#Область Валидация
// Проверяет, содержит ли входящая структура все обязательные ключи из шаблонной структуры
// Параметры:
//   ПроверяемаяСтруктура - Структура - структура, которую нужно проверить
// Возвращает:
//   Булево - Истина, если все обязательные ключи присутствуют, Ложь - если отсутствует хотя бы один
Функция ПроверитьОбязательныеПараметры(ПроверяемаяСтруктура) Экспорт
    // Получаем шаблонную структуру
    Шаблон = ОбязательныеПараметрыНоменклатуры();
    
    // Проверяем наличие всех ключей шаблона в проверяемой структуре
    Для Каждого Параметр Из Шаблон Цикл
        Если НЕ ПроверяемаяСтруктура.Свойство(Параметр.Ключ) Тогда
            Сообщить("Отсутствует обязательный параметр: " + Параметр.Ключ);
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Истина;  
	
КонецФункции     

#КонецОбласти    

Функция ПреобразоватьТовары(ТаблицаТоваров) Экспорт 
	
	Товары = Новый ТаблицаЗначений; 
	Товары.Колонки.Добавить("Номенклатура");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("Коментарий");

	Если НЕ ТипЗнч(ТаблицаТоваров) = Тип("ТаблицаЗначений") Тогда

	КонецЕсли;
	
	Для Каждого ЭлементТаблицы Из ТаблицаТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = ПроверкаНаличиеНоменклатуры(ЭлементТаблицы.Код).ОписаниеРезультата;
		НоваяСтрока.Количество = ЭлементТаблицы.Количество; 
		НоваяСтрока.Коментарий = СокрЛП(ЭлементТаблицы.Коментарий);
	КонецЦикла;
	
	Возврат Товары;
	
КонецФункции // ПреобразоватьТовары()

Функция ОбработатьМассивТоваровЗаказа(МассивТоваров) Экспорт 
	
	Ответ = Новый Структура;
	Товари = Новый ТаблицаЗначений;  
	Товари.Колонки.Добавить("Код");
	Товари.Колонки.Добавить("Наименование");
	Товари.Колонки.Добавить("Количество");
	Товари.Колонки.Добавить("Коментарий");
	
	Если НЕ ТипЗнч(МассивТоваров) = Тип("Массив") Тогда
		ОписаниеОшибки = "Код не является типов числа!"; 
		УниверсальныеФункции.СформаироватьОтвета(Ложь, Перечисления.ВидыВалидацииОтветов.НеСоответствиеТипов, ОписаниеОшибки);  
		Возврат Ответ;
	КонецЕсли;  
	
	Если МассивТоваров.Количество()=0 Тогда
		ОписаниеОшибки = "Пустой массив!"; 
		УниверсальныеФункции.СформаироватьОтвета(Ложь, Перечисления.ВидыВалидацииОтветов.НеНайдено, ОписаниеОшибки); 
		Возврат Ответ;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивТоваров Цикл
		Если ЭлементМассива["volume"] = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Товари.Добавить();
		НоваяСтрока.Код = ЭлементМассива["menuItemId"];  
		НоваяСтрока.Наименование = ЭлементМассива["menuItemName"]; 
        НоваяСтрока.Количество = ЭлементМассива["volume"]/1000; 
        НоваяСтрока.Коментарий = ЭлементМассива["notes"]; 			
	КонецЦикла;
	
	Возврат Товари; 
	
КонецФункции // ОбработатьМассивТоваровЗаказа()
